# Generate by ChatGPT

URL: https://chatgpt.com/share/67f1f386-9724-8007-ae08-4a48eedf9974

In [1]:
import pandas as pd
import numpy as np

data = {
    'id': [1, 2, 3, 4, 5],
    'nome': ['Ana', 'Bruno', 'Carlos', 'Diana', 'Eduardo'],
    'idade': [23, 25, np.nan, 28, 30],
    'cidade': ['SP', 'RJ', 'SP', np.nan, 'BH'],
    'salario': [4000, 4500, 4000, np.nan, 5000]
}

df = pd.DataFrame(data)

##### 1.Remova a coluna salario do DataFrame.

In [2]:
df.drop('salario', axis=1, inplace=True)
df

   id     nome  idade cidade
0   1      Ana   23.0     SP
1   2    Bruno   25.0     RJ
2   3   Carlos    NaN     SP
3   4    Diana   28.0    NaN
4   5  Eduardo   30.0     BH

##### 2. Remova a linha onde o valor da coluna cidade for nulo.

In [3]:
# Removendo colunas nulas.

df.dropna(subset=['cidade'], inplace=True)
df

   id     nome  idade cidade
0   1      Ana   23.0     SP
1   2    Bruno   25.0     RJ
2   3   Carlos    NaN     SP
4   5  Eduardo   30.0     BH

##### 3. Remova todas as linhas que possuem qualquer valor nulo.

In [4]:
df.dropna()

   id     nome  idade cidade
0   1      Ana   23.0     SP
1   2    Bruno   25.0     RJ
4   5  Eduardo   30.0     BH

##### 4. Remova todas as linhas onde todos os valores s√£o nulos.

In [5]:
full_null_dataset = {
    'id': [1, 2, 3],
    'nome': [np.nan, np.nan, np.nan],
    'idade': [np.nan, np.nan, np.nan],
    'cidade': [np.nan,np.nan,np.nan],
    'salario': [np.nan,np.nan,np.nan]
}
df_full_null = pd.DataFrame(full_null_dataset)

df_full_null

   id  nome  idade  cidade  salario
0   1   NaN    NaN     NaN      NaN
1   2   NaN    NaN     NaN      NaN
2   3   NaN    NaN     NaN      NaN

In [6]:
df_full_null.dropna(inplace=True)
df_full_null

Empty DataFrame
Columns: [id, nome, idade, cidade, salario]
Index: []

In [7]:
df['cidade'].isnull().any(axis=0)

df

   id     nome  idade cidade
0   1      Ana   23.0     SP
1   2    Bruno   25.0     RJ
2   3   Carlos    NaN     SP
4   5  Eduardo   30.0     BH